tests/mhdInterFoamTest_2D/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

inletFlowRate        0.001;
turbulentKE          2e-11;
turbulentEpsilon     1e-15;

// ************************************************************************* //
